{
  "title": "General Information RA 6713",
  "what": "<b>Republic Act No. 6713</b> is a law that sets the code of conduct and ethical standards for public officials and employees in the Philippines. It promotes honesty, integrity, and accountability in public service.",
  "tutorial": "<p>RA 6713 guides how public officials should act, including showing honesty, avoiding corruption, and serving the people with fairness.</p>",
  "steps": "<ol><li>Understand the purpose of the law.</li><li>Learn its 8 norms of conduct.</li><li>Know the duties and responsibilities it requires from public servants.</li></ol>",
  "sections": [
    {
      "title": "Declaration of Policies",
      "what": "<b>This section</b> explains the goal of promoting a high standard of ethics and accountability among public servants.",
      "tutorial": "<p>The state declares that public office is a public trust. Public servants must act with responsibility, integrity, and loyalty.</p>",
      "steps": "<ol><li>Read the official declaration in the law.</li><li>Understand its importance in building trust in government.</li><li>Apply it in your daily work as a public servant.</li></ol>",
      "sections": []
    },
    {
      "title": "Norms of Conduct",
      "what": "<b>These are the 8 guiding behaviors</b> expected from every public official or employee.",
      "tutorial": "<p>The 8 Norms are: Commitment to public interest, Professionalism, Justness and sincerity, Political neutrality, Responsiveness to the public, Nationalism and patriotism, Commitment to democracy, and Simple living.</p>",
      "steps": "<ol><li>Memorize the 8 norms.</li><li>Understand what each one means.</li><li>Reflect how you apply them in work and life.</li></ol>",
      "sections": [
        {
          "title": "1. Commitment to Public Interest",
          "what": "<b>This norm</b> means putting the people's needs above personal interest.",
          "tutorial": "<p>Example: Don't use public funds for private activities.</p>",
          "steps": "<ol><li>Think before making decisions.</li><li>Ask if it benefits the public.</li><li>Avoid any actions for personal gain.</li></ol>",
          "sections": []
        },
        {
          "title": "2. Professionalism",
          "what": "<b>Professionalism</b> means doing your job well, honestly, and on time.",
          "tutorial": "<p>Always report to work on time and finish tasks with quality.</p>",
          "steps": "<ol><li>Be punctual.</li><li>Respect work rules and ethics.</li><li>Strive to improve your performance.</li></ol>",
          "sections": []
        },
        {
          "title": "3. Justness and Sincerity",
          "what": "<b>Justness</b> means being fair. <b>Sincerity</b> means being honest.",
          "tutorial": "<p>Treat everyone fairly and avoid favoritism.</p>",
          "steps": "<ol><li>Be truthful in your actions and decisions.</li><li>Don't take bribes or gifts.</li><li>Uphold fairness and equality.</li></ol>",
          "sections": []
        },
        {
          "title": "4. Political Neutrality",
          "what": "<b>Public servants</b> must not favor any political party or candidate while on duty.",
          "tutorial": "<p>Stay neutral especially during elections while doing public duties.</p>",
          "steps": "<ol><li>Don't campaign for candidates during work.</li><li>Serve all people fairly, regardless of politics.</li><li>Focus on service, not politics.</li></ol>",
          "sections": []
        },
        {
          "title": "5. Responsiveness to the Public",
          "what": "<b>This means</b> public servants must serve the people quickly and politely.",
          "tutorial": "<p>Answer questions clearly and help clients as soon as possible.</p>",
          "steps": "<ol><li>Listen carefully to citizens.</li><li>Act promptly on requests or concerns.</li><li>Be kind and respectful in communication.</li></ol>",
          "sections": []
        },
        {
          "title": "6. Nationalism and Patriotism",
          "what": "<b>Love and loyalty</b> to the country and working for its progress.",
          "tutorial": "<p>Support local products, speak positively of the nation, and defend its interest.</p>",
          "steps": "<ol><li>Show respect for the flag and laws.</li><li>Promote Filipino values and culture.</li><li>Be proud of being a Filipino.</li></ol>",
          "sections": []
        },
        {
          "title": "7. Commitment to Democracy",
          "what": "<b>This means</b> respecting the rights of people and following democratic processes.",
          "tutorial": "<p>Support freedom of speech and fair elections.</p>",
          "steps": "<ol><li>Respect public opinion and rights.</li><li>Uphold rule of law.</li><li>Participate in lawful and civic duties.</li></ol>",
          "sections": []
        },
        {
          "title": "8. Simple Living",
          "what": "<b>This means</b> living within your means and avoiding luxury while in public service.",
          "tutorial": "<p>Don't flaunt wealth. Avoid extravagant spending especially from public funds.</p>",
          "steps": "<ol><li>Use resources wisely.</li><li>Dress and live modestly.</li><li>Be a good role model of humility.</li></ol>",
          "sections": []
        }
      ]
    },
    {
      "title": "Duties of Public Officials",
      "what": "<b>RA 6713</b> defines what all public servants must do, like submitting SALN and avoiding conflict of interest.",
      "tutorial": "<p>Submit SALN every year, avoid gifts, and always act in public interest.</p>",
      "steps": "<ol><li>Read the list of required duties under the law.</li><li>Understand the meaning and importance of each duty.</li><li>Practice them in your service daily.</li></ol>",
      "sections": []
    },
    {
      "title": "Statement of Assets, Liabilities, and Net Worth (SALN)",
      "what": "<b>SALN</b> is a yearly document that shows your income, properties, liabilities, and financial interests.",
      "tutorial": "<p>Example: Include all your cars, house, land, and bank accounts in the SALN truthfully.</p>",
      "steps": "<ol><li>Gather all documents about your income and properties.</li><li>Fill up the official SALN form honestly.</li><li>Submit it on time to the right office.</li></ol>",
      "sections": []
    },
    {
      "title": "Prohibited Acts and Penalties",
      "what": "<b>This section</b> tells what actions are not allowed and their punishments (e.g., accepting gifts or using position for gain).",
      "tutorial": "<p>Don’t accept gifts for services. Don’t use position to benefit friends or relatives.</p>",
      "steps": "<ol><li>Read the list of prohibited acts under RA 6713.</li><li>Understand the possible penalties like suspension or dismissal.</li><li>Avoid any action that could lead to violations.</li></ol>",
      "sections": []
    }
  ]
}
