{
    "title": "NUMBER SERIES",
    "what": "A number series is a sequence of numbers that are arranged in a specific order, following a certain rule or pattern. The goal is often to find the next number in the sequence or to identify a missing number.",
    "tutorial": "<h3>Introduction to Number Series</h3><p>Welcome to the world of number series! Think of it as a fun puzzle where you need to figure out the pattern in a list of numbers. For example, in the series <b>2, 4, 6, 8, ...</b>, you can probably guess the next number is 10 because the pattern is adding 2 to the previous number. We'll explore different types of patterns in this guide.</p>",
    "steps": "<ol><li><b>Analyze the Series:</b> Look at the numbers and try to see the relationship between them. Are they increasing, decreasing, or alternating?</li><li><b>Find the Pattern:</b> Determine the rule that connects the numbers. This could be addition, subtraction, multiplication, division, or a more complex pattern.</li><li><b>Apply the Pattern:</b> Use the rule you found to determine the missing number or the next number in the series.</li><li><b>Verify:</b> Check if your found pattern works for all the numbers in the series.</li></ol>",
    "sections": [
      {
        "title": "Arithmetic Progression (AP)",
        "what": "An arithmetic progression is a sequence of numbers where the difference between consecutive terms is constant. This constant difference is called the common difference (d).",
        "tutorial": "<h3>Understanding Arithmetic Progression</h3><p>Imagine you're saving money. If you start with $10 and add $5 every week, your savings would be $10, $15, $20, $25, and so on. This is an arithmetic progression with a first term of 10 and a common difference of 5. The formula to find any term (the nth term) is: <b>a<sub>n</sub> = a<sub>1</sub> + (n-1)d</b>, where <b>a<sub>1</sub></b> is the first term, <b>n</b> is the term number, and <b>d</b> is the common difference.</p>",
        "steps": "<ol><li><b>Identify the first term (a<sub>1</sub>):</b> This is the starting number in the series.</li><li><b>Calculate the common difference (d):</b> Subtract any term from its succeeding term (e.g., 2nd term - 1st term).</li><li><b>Use the formula:</b> To find the nth term, plug the values of a<sub>1</sub>, n, and d into the formula a<sub>n</sub> = a<sub>1</sub> + (n-1)d.</li><li><b>Example:</b> For the series 3, 7, 11, 15, ..., find the 10th term.</li><ol><li>a<sub>1</sub> = 3</li><li>d = 7 - 3 = 4</li><li>a<sub>10</sub> = 3 + (10-1) * 4 = 3 + 9 * 4 = 3 + 36 = 39</li></ol></ol>",
        "sections": [
          {
            "title": "Sum of an Arithmetic Series",
            "what": "The sum of an arithmetic series is the total of all the terms in an arithmetic progression.",
            "tutorial": "<h3>How to Calculate the Sum of an AP</h3><p>Let's say you want to find the total savings after 4 weeks from our previous example ($10, $15, $20, $25). You could add them up: 10 + 15 + 20 + 25 = 70. But for a long series, there's a formula: <b>S<sub>n</sub> = n/2 * (a<sub>1</sub> + a<sub>n</sub>)</b> or <b>S<sub>n</sub> = n/2 * [2a<sub>1</sub> + (n-1)d]</b>, where <b>S<sub>n</sub></b> is the sum of n terms.</p>",
            "steps": "<ol><li><b>Identify the knowns:</b> Find the first term (a<sub>1</sub>), the last term (a<sub>n</sub>) or the common difference (d), and the number of terms (n).</li><li><b>Choose the appropriate formula:</b> If you know the first and last terms, use S<sub>n</sub> = n/2 * (a<sub>1</sub> + a<sub>n</sub>). If you know the first term and the common difference, use S<sub>n</sub> = n/2 * [2a<sub>1</sub> + (n-1)d].</li><li><b>Calculate the sum:</b> Substitute the values into the formula and solve.</li><li><b>Example:</b> Find the sum of the first 10 terms of the series 3, 7, 11, 15, ...</li><ol><li>a<sub>1</sub> = 3, d = 4, n = 10</li><li>S<sub>10</sub> = 10/2 * [2*3 + (10-1)*4] = 5 * [6 + 9*4] = 5 * [6 + 36] = 5 * 42 = 210</li></ol></ol>",
            "sections": []
          }
        ]
      },
      {
        "title": "Geometric Progression (GP)",
        "what": "A geometric progression is a sequence of numbers where each term after the first is found by multiplying the previous one by a fixed, non-zero number called the common ratio (r).",
        "tutorial": "<h3>Understanding Geometric Progression</h3><p>Imagine a bouncing ball. If it's dropped from a height of 100cm and each bounce is 80% of the previous height, the heights would be 100, 80, 64, 51.2, and so on. This is a geometric progression with a first term of 100 and a common ratio of 0.8. The formula for the nth term is: <b>a<sub>n</sub> = a<sub>1</sub> * r<sup>(n-1)</sup></b>.</p>",
        "steps": "<ol><li><b>Identify the first term (a<sub>1</sub>):</b> This is the first number in the sequence.</li><li><b>Calculate the common ratio (r):</b> Divide any term by its preceding term (e.g., 2nd term / 1st term).</li><li><b>Use the formula:</b> To find the nth term, plug the values of a<sub>1</sub>, r, and n into the formula a<sub>n</sub> = a<sub>1</sub> * r<sup>(n-1)</sup>.</li><li><b>Example:</b> For the series 2, 6, 18, 54, ..., find the 7th term.</li><ol><li>a<sub>1</sub> = 2</li><li>r = 6 / 2 = 3</li><li>a<sub>7</sub> = 2 * 3<sup>(7-1)</sup> = 2 * 3<sup>6</sup> = 2 * 729 = 1458</li></ol></ol>",
        "sections": [
          {
            "title": "Sum of a Geometric Series",
            "what": "The sum of a geometric series is the sum of the terms of a geometric progression.",
            "tutorial": "<h3>How to Calculate the Sum of a GP</h3><p>To find the sum of a geometric series, we use the formula: <b>S<sub>n</sub> = a<sub>1</sub> * (1 - r<sup>n</sup>) / (1 - r)</b>, where <b>r ≠ 1</b>. This is useful for things like calculating the total distance a bouncing ball travels.",
            "steps": "<ol><li><b>Identify the first term (a<sub>1</sub>), common ratio (r), and number of terms (n).</b></li><li><b>Plug the values into the sum formula:</b> S<sub>n</sub> = a<sub>1</sub> * (1 - r<sup>n</sup>) / (1 - r).</li><li><b>Calculate the sum.</b></li><li><b>Example:</b> Find the sum of the first 5 terms of the series 2, 6, 18, 54, ...</li><ol><li>a<sub>1</sub> = 2, r = 3, n = 5</li><li>S<sub>5</sub> = 2 * (1 - 3<sup>5</sup>) / (1 - 3) = 2 * (1 - 243) / (-2) = 2 * (-242) / (-2) = 242</li></ol></ol>",
            "sections": []
          }
        ]
      },
      {
        "title": "Harmonic Progression (HP)",
        "what": "A sequence of numbers is said to be in harmonic progression if the reciprocals of the terms are in arithmetic progression.",
        "tutorial": "<h3>Understanding Harmonic Progression</h3><p>Harmonic progression might seem complex, but it's directly related to arithmetic progression. If you have a sequence like <b>1/2, 1/4, 1/6, 1/8, ...</b>, the reciprocals are <b>2, 4, 6, 8, ...</b> which is an arithmetic progression. To work with HP, you often convert it to an AP.</p>",
        "steps": "<ol><li><b>Take the reciprocals of the terms in the HP to form an AP.</b></li><li><b>Perform calculations on the AP.</b> For example, find the nth term or the sum of the AP.</li><li><b>Take the reciprocal of the result to get the answer for the HP.</b></li><li><b>Example:</b> Find the 5th term of the HP 1/3, 1/7, 1/11, ...</li><ol><li>The corresponding AP is 3, 7, 11, ...</li><li>In this AP, a<sub>1</sub> = 3 and d = 4.</li><li>The 5th term of the AP is a<sub>5</sub> = 3 + (5-1)*4 = 3 + 16 = 19.</li><li>Therefore, the 5th term of the HP is 1/19.</li></ol></ol>",
        "sections": []
      },
      {
        "title": "Fibonacci Series",
        "what": "The Fibonacci series is a sequence in which each number is the sum of the two preceding ones, usually starting with 0 and 1.",
        "tutorial": "<h3>The Fascinating Fibonacci Series</h3><p>The Fibonacci sequence is found everywhere in nature, from the arrangement of leaves on a stem to the branching of trees. The sequence starts <b>0, 1, 1, 2, 3, 5, 8, 13, 21, ...</b>. The rule is <b>F<sub>n</sub> = F<sub>n-1</sub> + F<sub>n-2</sub></b>.</p>",
        "steps": "<ol><li><b>Start with the first two terms:</b> F<sub>0</sub> = 0 and F<sub>1</sub> = 1.</li><li><b>Add the previous two terms to get the next term.</b></li><li><b>F<sub>2</sub> = F<sub>1</sub> + F<sub>0</sub> = 1 + 0 = 1.</b></li><li><b>F<sub>3</sub> = F<sub>2</sub> + F<sub>1</sub> = 1 + 1 = 2.</b></li><li><b>F<sub>4</sub> = F<sub>3</sub> + F<sub>2</sub> = 2 + 1 = 3.</b></li><li><b>Continue this pattern to generate the series.</b></li></ol>",
        "sections": []
      },
      {
        "title": "Other Common Number Series Patterns",
        "what": "Beyond the main types, many other patterns can be used to create number series. Recognizing these is key to solving a wide variety of problems.",
        "tutorial": "<h3>Exploring More Patterns</h3><p>Number series can be based on various mathematical concepts. Being familiar with these will make you a pro at solving them!</p>",
        "steps": "<ol><li><b>Look for squares or cubes of numbers.</b></li><li><b>Check for alternating patterns where two different operations are applied.</b></li><li><b>Consider if the series is a mix of two or more different series.</b></li><li><b>Practice is crucial to improve your pattern recognition skills.</b></li></ol>",
        "sections": [
          {
            "title": "Perfect Squares Series",
            "what": "A series where each term is the square of a number.",
            "tutorial": "<h3>Perfect Squares</h3><p>This series is formed by squaring consecutive numbers. For example, <b>1, 4, 9, 16, 25, ...</b> is a series of the squares of 1, 2, 3, 4, 5, etc. The pattern is <b>n<sup>2</sup></b>.</p>",
            "steps": "<ol><li><b>Identify the base numbers being squared.</b> For the series 1, 4, 9, 16, ..., the base numbers are 1, 2, 3, 4, ...</li><li><b>To find the next term, find the next base number and square it.</b> The next base number is 5, so the next term is 5<sup>2</sup> = 25.</li></ol>",
            "sections": []
          },
          {
            "title": "Perfect Cubes Series",
            "what": "A series where each term is the cube of a number.",
            "tutorial": "<h3>Perfect Cubes</h3><p>Similar to the squares series, this one is formed by cubing consecutive numbers. For example, <b>1, 8, 27, 64, 125, ...</b> is a series of the cubes of 1, 2, 3, 4, 5, etc. The pattern is <b>n<sup>3</sup></b>.</p>",
            "steps": "<ol><li><b>Identify the base numbers being cubed.</b> For the series 1, 8, 27, 64, ..., the base numbers are 1, 2, 3, 4, ...</li><li><b>To find the next term, find the next base number and cube it.</b> The next base number is 5, so the next term is 5<sup>3</sup> = 125.</li></ol>",
            "sections": []
          },
          {
            "title": "Mixed Series",
            "what": "A mixed series is a combination of two or more different types of series.",
            "tutorial": "<h3>Mixed-Up Series</h3><p>Sometimes, a single series can have multiple patterns woven into it. For example, the series <b>1, 2, 3, 4, 5, 6, ...</b> could be an alternating addition and subtraction, or it might be two separate series interleaved. For instance, <b>10, 30, 12, 32, 14, 34, ...</b> alternates between adding 2 to the first sub-series (10, 12, 14, ...) and adding 2 to the second sub-series (30, 32, 34, ...).</p>",
            "steps": "<ol><li><b>Look for alternating terms that follow their own separate patterns.</b></li><li><b>Separate the series into its component sub-series.</b></li><li><b>Identify the pattern for each sub-series.</b></li><li><b>Use the patterns to find the next term in the overall series.</b></li></ol>",
            "sections": []
          }
        ]
      }
    ]
  }